---
kind: type
id: T:Autodesk.Revit.DB.LightingSource
source: html/fdac3194-8087-233a-0383-878f4716aea1.htm
---
# Autodesk.Revit.DB.LightingSource

Indicates the lighting scheme type in rendering settings.

## Syntax (C#)
```csharp
public enum LightingSource
```